// โจทย์ปัญหา 1: หาความถี่ของตัวเลขในอาเรย์
// คำอธิบาย:
// ให้คุณเขียนฟังก์ชันที่รับอาเรย์ของตัวเลขจำนวนเต็ม และหาความถี่การเกิดของตัวเลขแต่ละตัวในอาเรย์ จากนั้นคืนค่าเป็นแผนที่ (map) ที่เก็บตัวเลขและความถี่

// ตัวอย่าง Input:
// []int{1, 2, 2, 3, 3, 3, 4}
// Output ที่คาดหวัง:
// map[int]int{1: 1, 2: 2, 3: 3, 4: 1}

// Tips:
// ใช้ map เพื่อเก็บตัวเลขและจำนวนครั้งที่พบ
// ใช้ for loop เพื่อวนซ้ำอาเรย์และเพิ่มค่าความถี่ใน map
package main

import "fmt"

func main() {
	input := []int{1, 2, 2, 3, 3, 3, 4}
	m := make(map[int]int)
	for _, v := range input {
		m[v] += 1
	}

	fmt.Println(m)
}
